{
  "uuid": "78cab4e5-4a7c-438d-9fce-9abbd135ca37",
  "name": "Class number problem",
  "link": "https://en.wikipedia.org/wiki/Class_number_problem",
  "rephrased": "Identify all imaginary quadratic fields with a specific class number.",
  "implication_form": null,
  "posed_by": "Carl Friedrich Gauss",
  "solved_by": "Various contributors (extensive computation effort in 1985)",
  "year_originated": 224,
  "explained": "The original formulation of the Class number problem, often referred to as Gauss's class number problem, is not a single conjecture but a challenge in number theory. It historically asked for an effective algorithm to determine all imaginary quadratic number fields (i.e., fields of the form \\(\\mathbb{Q}(\\sqrt{d})\\) with \\(d < 0\\)) with a specific, given class number. The class number measures the failure of unique factorization in the ring of integers of the field. While this specific problem (finding all fields *with a given class number*) was completely solved for imaginary quadratic fields in 1985, the core problem—characterizing imaginary quadratic fields based on their class number—remains effectively solved due to the known list. However, the analogous, much harder problem for *real* quadratic fields (positive discriminant) remains completely open. There is no single, formal conjecture statement provided here, but the problem revolves around the distribution and properties of class numbers across number fields, particularly imaginary and real quadratic fields.",
  "terms": [
    "Class number",
    "Ring of integers",
    "Ideal class group",
    "Discriminant",
    "Imaginary quadratic field",
    "Real quadratic field",
    "Unique factorization",
    "Kronecker's Jugendtraum",
    "Modular forms"
  ],
  "related_conjectures": [
    "Birch and Swinnerton-Dyer Conjecture",
    "Riemann Hypothesis",
    "Brumer-Stark Conjecture"
  ],
  "subjects": [
    "Algebraic number theory",
    "Class field theory",
    "Arithmetic geometry"
  ]
}