{
  "uuid": "dfb43de5-cbaf-4e22-aff7-cec7ddaadc33",
  "name": "Hartmanis–Stearns conjecture",
  "link": "https://en.wikipedia.org/wiki/Hartmanis%E2%80%93Stearns_conjecture",
  "rephrased": "The Hartmanis-Stearns conjecture posits that any number that can be generated by a Turing machine in real-time (outputting one digit at a time within a fixed time bound per digit) must be a rational number.",
  "implication_form": "If a real-time computable number exists, then it must be rational.",
  "posed_by": "Juris Hartmanis and Richard E. Stearns",
  "solved_by": "unsolved",
  "year_originated": 60,
  "explained": "The Hartmanis–Stearns conjecture is a foundational open problem in theoretical computer science concerning the relationship between time complexity and the computability of real numbers. It posits that if a real number can be computed by a multitape Turing machine in real-time (i.e., the machine writes the n-th digit using only O(n) time steps in total, with the time per digit bounded by a constant), then that number must be a transcendental number. In other words, no algebraic irrational number (which includes all rational numbers) can be computed in real-time by a Turing machine.",
  "terms": [
    "Hartmanis–Stearns conjecture",
    "Computational complexity theory",
    "Real-time computability",
    "Multitape Turing machine",
    "Bounded time complexity",
    "Output tape",
    "Transcendental numbers",
    "Algebraic irrational numbers",
    "Time hierarchy theorems",
    "Computability theory"
  ],
  "related_conjectures": [
    "P versus NP problem (related through the broader field of computational complexity)",
    "Time hierarchy theorems (provide foundational results on time complexity)",
    "Conjectures regarding the computability of specific real numbers (e.g., whether π or e can be computed faster than linear time)",
    "Research on the limits of real-time computation in various models (e.g., cellular automata, streaming algorithms)"
  ],
  "subjects": [
    "Theoretical Computer Science",
    "Computational Complexity",
    "Automata Theory",
    "Computability Theory",
    "Number Theory"
  ]

}
