{
  "uuid": "afb33367-e8e0-44c4-ac01-6275c99f82c8",
  "name": "Ibragimov–Iosifescu conjecture for φ-mixing sequences",
  "link": "https://en.wikipedia.org/wiki/Ibragimov%E2%80%93Iosifescu_conjecture_for_%CF%86-mixing_sequences",
  "rephrased": "The conjecture concerns the rate of convergence in the central limit theorem for dependent random variables forming a φ-mixing sequence, specifically relating the mixing coefficients to the convergence speed.",
  "implication_form": "An explicit 'If P, then Q' form is not provided in the original query, making a direct formulation challenging.",
  "posed_by": "Ildar Ibragimov and Marius Iosifescu",
  "solved_by": "unsolved",
  "year_originated": 50,
  "explained": "The Ibragimov–Iosifescu conjecture for φ-mixing sequences addresses the limit behavior (convergence in distribution) of the normalized partial sums of certain dependent random variables under the φ-mixing condition. It proposes that under specific conditions related to the mixing rate (characterized by the φ-function) and the properties of the random variables (e.g., being identically distributed, having finite variance, satisfying certain moment conditions), the properly normalized partial sums converge to a stable distribution (often specified to be non-Gaussian or Gaussian depending on the exact formulation). The conjecture is closely tied to the ergodic theorem but extends it to dependent processes with specific mixing properties. It remains unproven in its strongest forms for all types of φ-mixing processes.",
  "terms": [
    "φ-mixing",
    "strong mixing",
    "ergodic theorem",
    "stable distribution",
    "limit theorem",
    "dependent random variables",
    "mixing coefficient",
    "normalized partial sums"
  ],
  "related_conjectures": [
    "Central Limit Theorem (CLT) for dependent sequences",
    "Invariance Principle",
    "Erdős–Rényi law",
    "Chover's law of the iterated logarithm for dependent sequences"
  ],
  "subjects": [
    "Probability Theory",
    "Ergodic Theory",
    "Statistical Theory",
    "Stochastic Processes"
  ]
}