{
  "uuid": "9b2fbd7e-2c84-410f-9a2d-46eced39304f",
  "name": "Lambda g conjecture",
  "link": "https://en.wikipedia.org/wiki/Lambda_g_conjecture",
  "rephrased": "The Lambda_g conjecture states that the intersection number of the tautological class \\lambda_g (the top Chern class of the Hodge bundle) with the fundamental class of the Deligne-Mumford compactification \\bar{M}_{g,n} is equal to the genus g Faber-Knudsen class.",
  "implication_form": "If the intersection number of \\lambda_g with the fundamental class of \\bar{M}_{g,n} is computed, then it equals the genus g Faber-Knudsen class.",
  "posed_by": "Seth A. Kleinerman (affiliated with Harvard University at the time)",
  "solved_by": "unsolved",
  "year_originated": 23,
  "explained": "The λ_g conjecture, proposed by R. Pandharipande and T. Graber (later refined by C. Faber), addresses the intersection theory on the Deligne-Mumford moduli space \\(\\bar{M}_{g,n}\\) of stable algebraic curves. It concerns the tautological ring generated by kappa classes \\(\\kappa_i\\), which are the Chern classes of the cotangent bundles to the moduli space. The conjecture states that the class \\(c_g\\), which is the g-th power of the Chern character of the cotangent bundle (related to the boundary strata), is equal to the sum over all partitions of \\(g-1\\) of the classes corresponding to those partitions in the tautological ring. More formally, it relates the integral of certain cohomology classes (involving the kappa classes) over the moduli space to the number of partitions of an integer. A key formulation involves the statement that the integral of the class \\(\\pi_* c_g\\) (where \\(\\pi\\) is the projection from the universal curve) is equal to the number of partitions of \\(g- (n-1)\\) or something similar, but the exact statement varies depending on the formulation and the context (e.g., for \\(n=0\\), for \\(n=2\\), etc.).",
  "terms": [
    "Deligne-Mumford compactification",
    "\\(\\bar{M}_{g,n}\\)",
    "Moduli space of curves",
    "Tautological classes",
    "kappa classes (\\(\\kappa_i\\))",
    "Cotangent bundle",
    "Chern character",
    "Intersection theory",
    "Gromov-Witten invariants",
    "Riemann surfaces",
    "Stable curves"
  ],
  "related_conjectures": [
    "Faber-Kanev conjecture",
    "Faber-Pandharipande conjecture",
    "Gromov-Witten theory conjectures",
    "Real Gromov-Witten conjecture",
    "Connes-Donaldson-Teleman conjecture (TCFT)"
  ],
  "subjects": [
    "Algebraic geometry",
    "Moduli theory",
    "Intersection theory",
    "Gromov-Witten theory",
    "Symplectic geometry",
    "Topological recursion"
  ]
}