{
  "uuid": "412b3a44-950c-4890-9a5a-efc5ce16ba4c",
  "name": "Littlewood conjecture",
  "link": "https://en.wikipedia.org/wiki/Littlewood_conjecture",
  "rephrased": "For any two irrational numbers, it's impossible to find sequences of integers where both numbers are simultaneously very close to integers when scaled by those integers.",
  "implication_form": "If there exist integers n and integers k, m such that the distance from nα to the nearest integer is less than 1/n^{1/2} and the distance from nβ to the nearest integer is less than 1/n^{1/2}, then the product of these distances times n approaches zero as n increases.",
  "posed_by": "J. E. Littlewood",
  "solved_by": "unsolved",
  "year_originated": 94,
  "explained": "The Littlewood conjecture is an open problem in Diophantine approximation. It states that for any two real numbers α and β, the following limit inferior is zero:\n\nlim inf_{n→∞} n ⋅ ||nα|| ⋅ ||nβ|| = 0\n\nwhere ||x|| denotes the distance from x to the nearest integer. In other words, for any fixed α and β, there are infinitely many positive integers n such that both nα and nβ are simultaneously very close to integers (their distances to the nearest integers being small), and the product of n and these two distances becomes arbitrarily small infinitely often.",
  "terms": [
    "Diophantine approximation",
    "Irrational rotation",
    "Multiplicative Diophantine approximation",
    "Inhomogeneous approximation",
    "Discrepancy"
  ],
  "related_conjectures": [
    "Davenport-Eschere conjecture",
    "Zygmund conjecture",
    "Known results include connections to the work of Dirichlet, Hurwitz, and Khinchin on simultaneous Diophantine approximation, but these are theorems rather than conjectures. The conjecture is often considered alongside problems in uniform distribution theory."
  ],
  "subjects": [
    "Diophantine approximation",
    "Ergodic theory",
    "Uniform distribution theory",
    "Number theory"
  ]
}