{
  "uuid": "78ccb0d9-b87b-4ff7-ab21-34039575e017",
  "name": "Umbral moonshine",
  "link": "https://en.wikipedia.org/wiki/Umbral_moonshine",
  "rephrased": "Umbral moonshine describes a surprising connection between specific geometric structures called Niemeier lattices and special mathematical functions known as Ramanujan mock theta functions.",
  "implication_form": "If one considers the properties of a Niemeier lattice, then specific relationships with Ramanujan's mock theta functions emerge.",
  "posed_by": "Unknown",
  "solved_by": "Unsolved",
  "year_originated": 8,
  "explained": "The Umbral Moonshine conjecture, proposed by Duncan, Edgardo, and collaborators, posits a deep connection between certain 24-dimensional Niemeier lattices (specific types of even lattices) and Ramanujan's mock theta functions. It states that to each of the 24 Niemeier types (corresponding to specific root systems within the lattice structure), there exists a vertex operator algebra (VOA) such that the graded dimensions of its irreducible representations are given by the coefficients of a specific generalized mock theta function. This function is constructed using the weight 1/2 vectors associated with the Niemeier lattice, and the resulting mock theta function transforms like a modular form for a congruence subgroup of SL(2,ℤ) under the action of the automorphism group of the lattice (which is a finite group related to the Mathieu groups). This conjecture generalizes the Mathieu moonshine phenomenon by connecting more complex structures (Niemeier lattices) to mock theta functions.",
  "terms": [
    "Niemeier lattice",
    "Vertex operator algebra (VOA)",
    "Mock theta function",
    "Generalized moonshine",
    "Mathieu group",
    "Modular form",
    "Automorphism group",
    "Graded dimension"
  ],
  "related_conjectures": [
    "Mathieu moonshine",
    "Monstrous moonshine",
    "Generalized moonshine",
    "K3 moonshine"
  ],
  "subjects": [
    "Number theory",
    "Group theory",
    "Representation theory",
    "Modular forms",
    "Vertex algebra theory"
  ]
}